from langchain import PromptTemplate

qna_template = """
أجب عن السؤال التالي باللغة العربية فقط باستخدام السياق المقدم.
إذا لم تكن الإجابة موجودة في السياق، قل 'لا توجد إجابة متاحة'.
قم بتقديم شرح مفصل وشامل، موضحًا السياق ومضمّنًا أي تفاصيل قانونية أو إجرائية ذات صلة إذا لزم الأمر.

### أمثلة:
### السؤال:
ما معني العلاوة الدورية ؟
### الإجابة:
العلاوة الدورية هي مبلغ نقدي ثابت يضاف الي أجر العامل في موعد دوري غالباً ما يكون أول يناير من كل عام ، ويتكرر صرفها بمرور سنة على صرف أخر علاوة ، وتحتسب أول علاوة بعد مرور عام على استلام العامل للعمل . وقد قرر المشرع في قانون العمل مبدأ عام ، حيث جعل العلاوة الدورية السنوية جزءاً من الأجر وتأخذ حكمه ( المادة رقم 1 فقرة ج بند 3 ) . وبهذا المعنى تعتبر العلاوة الدورية السنـوية زيادة سنـوية تعطى للعـامل زيـادة على أجره الأصلي ( أجر الالتحاق بالعمل ) . والعلاوة الدورية السنوية ، منشأها إرادة المشرع ، فهي مقررة بمقتضى حكم المادة الثانية من مواد إصدار قانون العمل الصادر بالقانون رقم 12 لسنه 2003 ، وهى لا تقل عن 7 % من الأجر الأساسي الذي تحسب على أساسه اشتراكات التأمينات الاجتماعية ( دون حد أدنى أو أقصى ) على خلاف ما كان مقرراً في قانون العمل السابق بمقتضى نص المادة 42 حين جعل المشرع حدها الأدنى جنيهان وحدها الأقصى سبعة جنيهات . ويلتزم أصحاب الأعمال – أيا كان عدد عمالهم – بصرف العلاوة الدورية السنوية في تاريخ استحقاقها ، وبنسبتها المقررة حسب التفصيل السابق و صدر الحكم التالي الذي جاء فيه للتاكيد علي ماسبق " وأن قرار رئيس مجلس الإدارة لا يعدو أن يكون قراراً كاشفاً وصدوره في تاريخ متأخر عن ميعاد استحقاق العلاوة لا يهدر حق العاملين في استحقاقها بأثر رجعى من تاريخ مرور سنه ( من تاريخ استلام العامل للعمل أو مرور سنة على صرف أخر علاوة ) " . و كذلك الحكم " هذا ومن المستقر عليه فقها وقضاء أن استمرار صاحب العمل بصفة دورية ومنظمة في منح علاوات دورية بمقدار ثابت يولد لديهم اعتقاداً بالتزام صاحب العمل بالاستمرار في منحها لهم وبحقهم في اقتضائها كما لا يصح له تعليق صرف هذه العلاوة في أحدى السنوات على موافقة مجلس الإدارة ( نقض مدني 139 لسنه 37 ق 28/3/1982 ) .'
### السؤال:
ما هو الميعاد الخاص ببطلان أي مخالصة عن حق من حقوق العامل؟
### الإجابة:
يقع باطلاً كل شرط أو اتفاق يخالف أحكام هذا القانون ولو كان سابقاً علي العمل به ، إذا كان يتضمن انتقاصاً من حقوق العامل المقررة فيه. ويستمر العمل بأية مزايا أو شروط تكون مقررة أو تقرر في عقود العمل الفردية أو الجماعية أو الأنظمة الأساسية أو غيرها من لوائح المنشأة ، أو بمقتضى العرف . وتقع باطلة كل مصالحة تتضمن انتقاصاً أو إبراء من حقوق العامل الناشئة عن عقد العمل خلال مدة سريانه أو خلال ثلاثة أشهر من تاريخ انتهائه متي كانت تخالف أحكام هذا القانون
### السؤال:
 ما هي حقوق العامل في حالة الفصل التعسفي؟
### الإجابة:
وفقًا للمادة 122 في قانون العمل رقم 12 لسنة 2003
للعامل الحق في المطالبة بتعويض عن الفصل التعسفي.
يتم تحديد التعويض بناءً على الأجر وظروف الفصل.
### السياق:
{context}

### السؤال:
{question}

### الإجابة:

"""

qna_prompt = PromptTemplate(
    template=qna_template,
    input_variables=['context', 'question']
    )